In [1]:
%load_ext sql

In [2]:
%sql sqlite:///C:\Users\bilene\Downloads\book.db

In [5]:
output = %sql SELECT * FROM indicators0

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

In [8]:
output

[('CHN', 1386.4, 12143.5, 76.4, 1469.88),
 ('FRA', 66.87, 2586.29, 82.5, 69.02),
 ('GBR', 66.06, 2637.87, 81.2, 79.1),
 ('IND', 1338.66, 2652.55, 68.8, 1168.9),
 ('USA', 325.15, 19485.4, 78.5, 391.6)]

In [10]:
import pandas as pd
df = pd.DataFrame(output)
print(df)

  code      pop       gdp  life     cell
0  CHN  1386.40  12143.50  76.4  1469.88
1  FRA    66.87   2586.29  82.5    69.02
2  GBR    66.06   2637.87  81.2    79.10
3  IND  1338.66   2652.55  68.8  1168.90
4  USA   325.15  19485.40  78.5   391.60

In [24]:
%%sql
SELECT * FROM indicators
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1960, 'ABW', 0.05, None, 65.7, 0.0, None, None),
 (1960, 'AFG', 9.0, 0.54, 32.3, 0.0, None, 49.9),
 (1960, 'AGO', 5.45, None, 33.3, 0.0, 127.5, 123.3),
 (1960, 'ALB', 1.61, None, 62.3, 0.0, None, None),
 (1960, 'AND', 0.01, None, None, 0.0, None, None)]

In [15]:
%%sql
output2 <<
SELECT * FROM indicators

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.
Returning data to local variable output2

In [16]:
pd.DataFrame(output2)

       year code    pop     gdp  life  cell  imports  exports
0      1960  ABW   0.05     NaN  65.7   0.0      NaN      NaN
1      1960  AFG   9.00    0.54  32.3   0.0      NaN     49.9
2      1960  AGO   5.45     NaN  33.3   0.0    127.5    123.3
3      1960  ALB   1.61     NaN  62.3   0.0      NaN      NaN
4      1960  AND   0.01     NaN   NaN   0.0      NaN      NaN
...     ...  ...    ...     ...   ...   ...      ...      ...
12857  2018  XKX   1.85    7.90   NaN   NaN      NaN      NaN
12858  2018  YEM  28.50   26.91   NaN   NaN      NaN      NaN
12859  2018  ZAF  57.78  366.30   NaN   NaN      NaN      NaN
12860  2018  ZMB  17.35   26.72   NaN   NaN      NaN      NaN
12861  2018  ZWE  14.44   31.00   NaN   NaN      NaN      NaN

[12862 rows x 8 columns]

In [18]:
%%sql
--Here is a one line comment
/* Here is a multi line comment,
My comment continues here,
And it ends here */
SELECT * FROM indicators0

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('CHN', 1386.4, 12143.5, 76.4, 1469.88),
 ('FRA', 66.87, 2586.29, 82.5, 69.02),
 ('GBR', 66.06, 2637.87, 81.2, 79.1),
 ('IND', 1338.66, 2652.55, 68.8, 1168.9),
 ('USA', 325.15, 19485.4, 78.5, 391.6)]

In [21]:
%%sql
-- This is to see what tables exist in the database
SELECT name FROM sqlite_master
WHERE type='table'

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('countries',), ('indicators',), ('indicators0',), ('topnames',)]

In [22]:
%%sql
SELECT * from countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0)]

In [27]:
%%sql
PRAGMA table_info(countries)

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(0, 'code', 'char(3)', 1, None, 1),
 (1, 'country', 'varchar(64)', 0, 'NULL', 0),
 (2, 'region', 'varchar(64)', 0, 'NULL', 0),
 (3, 'income', 'varchar(64)', 0, 'NULL', 0),
 (4, 'land', 'float', 0, 'NULL', 0)]

In [4]:
%%sql
SELECT * FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Female', 'Mary', 7065),
 (1880, 'Male', 'John', 9655),
 (1881, 'Female', 'Mary', 6919),
 (1881, 'Male', 'John', 8769),
 (1882, 'Female', 'Mary', 8148)]

In [5]:
%%sql
-- only grabs the columns you listed
SELECT year, name FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Mary'),
 (1880, 'John'),
 (1881, 'Mary'),
 (1881, 'John'),
 (1882, 'Mary')]

In [7]:
%%sql
-- aliases for columns
SELECT year AS myyear, name AS babyname FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Mary'),
 (1880, 'John'),
 (1881, 'Mary'),
 (1881, 'John'),
 (1882, 'Mary')]

In [8]:
%%sql
--return data post 2000 (including 2000).
SELECT * FROM topnames
WHERE year>=2000
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Female', 'Emily', 25057),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Female', 'Emily', 24464)]

In [10]:
%%sql
--return data post 2000 (including 2000) only for Female baby names. Use "AND"
SELECT * FROM topnames
WHERE year>=2000 AND sex=="Female"
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2001, 'Female', 'Emily', 25057),
 (2002, 'Female', 'Emily', 24464),
 (2003, 'Female', 'Emily', 25691),
 (2004, 'Female', 'Emily', 25037)]

In [11]:
%%sql
--return data post 2000 (including 2000) only for Female baby names. Use "AND"
-- Note that "=" instead of "==" is the SQL way of checking equivalence
SELECT * FROM topnames
WHERE year>=2000 AND sex="Female"
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2001, 'Female', 'Emily', 25057),
 (2002, 'Female', 'Emily', 24464),
 (2003, 'Female', 'Emily', 25691),
 (2004, 'Female', 'Emily', 25037)]

In [12]:
%%sql
SELECT * FROM topnames
WHERE name!='John'
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Female', 'Mary', 7065),
 (1881, 'Female', 'Mary', 6919),
 (1882, 'Female', 'Mary', 8148),
 (1883, 'Female', 'Mary', 8012),
 (1884, 'Female', 'Mary', 9217)]

In [13]:
%%sql
-- SQL way of doing it
SELECT * FROM topnames
WHERE name<>'John'
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Female', 'Mary', 7065),
 (1881, 'Female', 'Mary', 6919),
 (1882, 'Female', 'Mary', 8148),
 (1883, 'Female', 'Mary', 8012),
 (1884, 'Female', 'Mary', 9217)]

In [14]:
%%sql
-- return baby names post 2000 (included) and only the baby names Emily and Jacob
-- return all data
-- use parantheses; "AND", "OR"
SELECT * FROM topnames
WHERE year>=2000 AND (name='Emily' OR name='Jacob')

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Female', 'Emily', 25057),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Female', 'Emily', 24464),
 (2002, 'Male', 'Jacob', 30574),
 (2003, 'Female', 'Emily', 25691),
 (2003, 'Male', 'Jacob', 29638),
 (2004, 'Female', 'Emily', 25037),
 (2004, 'Male', 'Jacob', 27881),
 (2005, 'Female', 'Emily', 23940),
 (2005, 'Male', 'Jacob', 25833),
 (2006, 'Female', 'Emily', 21404),
 (2006, 'Male', 'Jacob', 24845),
 (2007, 'Female', 'Emily', 19355),
 (2007, 'Male', 'Jacob', 24282),
 (2008, 'Male', 'Jacob', 22594),
 (2009, 'Male', 'Jacob', 21175),
 (2010, 'Male', 'Jacob', 22127),
 (2011, 'Male', 'Jacob', 20371),
 (2012, 'Male', 'Jacob', 19074)]

In [15]:
%%sql
-- "IN" approach similar to "isin() in pandas"
SELECT * FROM topnames
WHERE year>=2000 AND name IN ('Emily','Jacob')

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Female', 'Emily', 25057),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Female', 'Emily', 24464),
 (2002, 'Male', 'Jacob', 30574),
 (2003, 'Female', 'Emily', 25691),
 (2003, 'Male', 'Jacob', 29638),
 (2004, 'Female', 'Emily', 25037),
 (2004, 'Male', 'Jacob', 27881),
 (2005, 'Female', 'Emily', 23940),
 (2005, 'Male', 'Jacob', 25833),
 (2006, 'Female', 'Emily', 21404),
 (2006, 'Male', 'Jacob', 24845),
 (2007, 'Female', 'Emily', 19355),
 (2007, 'Male', 'Jacob', 24282),
 (2008, 'Male', 'Jacob', 22594),
 (2009, 'Male', 'Jacob', 21175),
 (2010, 'Male', 'Jacob', 22127),
 (2011, 'Male', 'Jacob', 20371),
 (2012, 'Male', 'Jacob', 19074)]

In [16]:
%%sql
-- filter data to years between 2000 and 2010 inclusive.
SELECT * FROM topnames
WHERE year>=2000 AND year<=2010

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Female', 'Emily', 25057),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Female', 'Emily', 24464),
 (2002, 'Male', 'Jacob', 30574),
 (2003, 'Female', 'Emily', 25691),
 (2003, 'Male', 'Jacob', 29638),
 (2004, 'Female', 'Emily', 25037),
 (2004, 'Male', 'Jacob', 27881),
 (2005, 'Female', 'Emily', 23940),
 (2005, 'Male', 'Jacob', 25833),
 (2006, 'Female', 'Emily', 21404),
 (2006, 'Male', 'Jacob', 24845),
 (2007, 'Female', 'Emily', 19355),
 (2007, 'Male', 'Jacob', 24282),
 (2008, 'Female', 'Emma', 18813),
 (2008, 'Male', 'Jacob', 22594),
 (2009, 'Female', 'Isabella', 22306),
 (2009, 'Male', 'Jacob', 21175),
 (2010, 'Female', 'Isabella', 22913),
 (2010, 'Male', 'Jacob', 22127)]

In [17]:
%%sql
-- SQL way of doing it
SELECT * FROM topnames
WHERE year BETWEEN 2000 AND 2010

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Female', 'Emily', 25057),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Female', 'Emily', 24464),
 (2002, 'Male', 'Jacob', 30574),
 (2003, 'Female', 'Emily', 25691),
 (2003, 'Male', 'Jacob', 29638),
 (2004, 'Female', 'Emily', 25037),
 (2004, 'Male', 'Jacob', 27881),
 (2005, 'Female', 'Emily', 23940),
 (2005, 'Male', 'Jacob', 25833),
 (2006, 'Female', 'Emily', 21404),
 (2006, 'Male', 'Jacob', 24845),
 (2007, 'Female', 'Emily', 19355),
 (2007, 'Male', 'Jacob', 24282),
 (2008, 'Female', 'Emma', 18813),
 (2008, 'Male', 'Jacob', 22594),
 (2009, 'Female', 'Isabella', 22306),
 (2009, 'Male', 'Jacob', 21175),
 (2010, 'Female', 'Isabella', 22913),
 (2010, 'Male', 'Jacob', 22127)]

In [22]:
%%sql
--return baby names that start with "J"
SELECT * FROM topnames
WHERE name LIKE 'J%'

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Male', 'John', 9655),
 (1881, 'Male', 'John', 8769),
 (1882, 'Male', 'John', 9557),
 (1883, 'Male', 'John', 8894),
 (1884, 'Male', 'John', 9388),
 (1885, 'Male', 'John', 8756),
 (1886, 'Male', 'John', 9026),
 (1887, 'Male', 'John', 8110),
 (1888, 'Male', 'John', 9247),
 (1889, 'Male', 'John', 8548),
 (1890, 'Male', 'John', 8502),
 (1891, 'Male', 'John', 7680),
 (1892, 'Male', 'John', 9039),
 (1893, 'Male', 'John', 8049),
 (1894, 'Male', 'John', 8238),
 (1895, 'Male', 'John', 8320),
 (1896, 'Male', 'John', 8138),
 (1897, 'Male', 'John', 7550),
 (1898, 'Male', 'John', 8159),
 (1899, 'Male', 'John', 6990),
 (1900, 'Male', 'John', 9829),
 (1901, 'Male', 'John', 6900),
 (1902, 'Male', 'John', 7907),
 (1903, 'Male', 'John', 7608),
 (1904, 'Male', 'John', 8108),
 (1905, 'Male', 'John', 8060),
 (1906, 'Male', 'John', 8265),
 (1907, 'Male', 'John', 8983),
 (1908, 'Male', 'John', 9342),
 (1909, 'Male', 'John', 9591),
 (1910, 'Male', 'John', 11450),
 (1911, 'Male', 'John', 13446),
 (1912, 'Male', 'John', 24587),
 (1913, 'Male', 'John', 29329),
 (1914, 'Male', 'John', 37948),
 (1915, 'Male', 'John', 47576),
 (1916, 'Male', 'John', 50043),
 (1917, 'Male', 'John', 51853),
 (1918, 'Male', 'John', 56558),
 (1919, 'Male', 'John', 53528),
 (1920, 'Male', 'John', 56913),
 (1921, 'Male', 'John', 58217),
 (1922, 'Male', 'John', 57277),
 (1923, 'Male', 'John', 57470),
 (1940, 'Male', 'James', 62473),
 (1941, 'Male', 'James', 66736),
 (1942, 'Male', 'James', 77176),
 (1943, 'Male', 'James', 80261),
 (1944, 'Male', 'James', 76951),
 (1945, 'Male', 'James', 74449),
 (1946, 'Male', 'James', 87436),
 (1947, 'Male', 'James', 94757),
 (1948, 'Male', 'James', 88584),
 (1949, 'Male', 'James', 86857),
 (1950, 'Male', 'James', 86224),
 (1951, 'Male', 'James', 87261),
 (1952, 'Male', 'James', 87063),
 (1970, 'Female', 'Jennifer', 46157),
 (1971, 'Female', 'Jennifer', 56783),
 (1972, 'Female', 'Jennifer', 63603),
 (1973, 'Female', 'Jennifer', 62447),
 (1974, 'Female', 'Jennifer', 63114),
 (1975, 'Female', 'Jennifer', 58183),
 (1976, 'Female', 'Jennifer', 59474),
 (1977, 'Female', 'Jennifer', 58964),
 (1978, 'Female', 'Jennifer', 56321),
 (1979, 'Female', 'Jennifer', 56717),
 (1980, 'Female', 'Jennifer', 58375),
 (1981, 'Female', 'Jennifer', 57049),
 (1982, 'Female', 'Jennifer', 57117),
 (1983, 'Female', 'Jennifer', 54346),
 (1984, 'Female', 'Jennifer', 50559),
 (1985, 'Female', 'Jessica', 48347),
 (1986, 'Female', 'Jessica', 52677),
 (1987, 'Female', 'Jessica', 55994),
 (1988, 'Female', 'Jessica', 51543),
 (1989, 'Female', 'Jessica', 47884),
 (1990, 'Female', 'Jessica', 46475),
 (1993, 'Female', 'Jessica', 34987),
 (1994, 'Female', 'Jessica', 32117),
 (1995, 'Female', 'Jessica', 27938),
 (1999, 'Male', 'Jacob', 35363),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Male', 'Jacob', 30574),
 (2003, 'Male', 'Jacob', 29638),
 (2004, 'Male', 'Jacob', 27881),
 (2005, 'Male', 'Jacob', 25833),
 (2006, 'Male', 'Jacob', 24845),
 (2007, 'Male', 'Jacob', 24282),
 (2008, 'Male', 'Jacob', 22594),
 (2009, 'Male', 'Jacob', 21175),
 (2010, 'Male', 'Jacob', 22127),
 (2011, 'Male', 'Jacob', 20371),
 (2012, 'Male', 'Jacob', 19074)]

In [23]:
%%sql
--return baby names that start with "J" and end with "n"
SELECT * FROM topnames
WHERE name LIKE 'J%n'

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Male', 'John', 9655),
 (1881, 'Male', 'John', 8769),
 (1882, 'Male', 'John', 9557),
 (1883, 'Male', 'John', 8894),
 (1884, 'Male', 'John', 9388),
 (1885, 'Male', 'John', 8756),
 (1886, 'Male', 'John', 9026),
 (1887, 'Male', 'John', 8110),
 (1888, 'Male', 'John', 9247),
 (1889, 'Male', 'John', 8548),
 (1890, 'Male', 'John', 8502),
 (1891, 'Male', 'John', 7680),
 (1892, 'Male', 'John', 9039),
 (1893, 'Male', 'John', 8049),
 (1894, 'Male', 'John', 8238),
 (1895, 'Male', 'John', 8320),
 (1896, 'Male', 'John', 8138),
 (1897, 'Male', 'John', 7550),
 (1898, 'Male', 'John', 8159),
 (1899, 'Male', 'John', 6990),
 (1900, 'Male', 'John', 9829),
 (1901, 'Male', 'John', 6900),
 (1902, 'Male', 'John', 7907),
 (1903, 'Male', 'John', 7608),
 (1904, 'Male', 'John', 8108),
 (1905, 'Male', 'John', 8060),
 (1906, 'Male', 'John', 8265),
 (1907, 'Male', 'John', 8983),
 (1908, 'Male', 'John', 9342),
 (1909, 'Male', 'John', 9591),
 (1910, 'Male', 'John', 11450),
 (1911, 'Male', 'John', 13446),
 (1912, 'Male', 'John', 24587),
 (1913, 'Male', 'John', 29329),
 (1914, 'Male', 'John', 37948),
 (1915, 'Male', 'John', 47576),
 (1916, 'Male', 'John', 50043),
 (1917, 'Male', 'John', 51853),
 (1918, 'Male', 'John', 56558),
 (1919, 'Male', 'John', 53528),
 (1920, 'Male', 'John', 56913),
 (1921, 'Male', 'John', 58217),
 (1922, 'Male', 'John', 57277),
 (1923, 'Male', 'John', 57470)]

In [24]:
%%sql
--return baby names that start with "J" and are 5 characters long
SELECT * FROM topnames
WHERE name LIKE 'J____'

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1940, 'Male', 'James', 62473),
 (1941, 'Male', 'James', 66736),
 (1942, 'Male', 'James', 77176),
 (1943, 'Male', 'James', 80261),
 (1944, 'Male', 'James', 76951),
 (1945, 'Male', 'James', 74449),
 (1946, 'Male', 'James', 87436),
 (1947, 'Male', 'James', 94757),
 (1948, 'Male', 'James', 88584),
 (1949, 'Male', 'James', 86857),
 (1950, 'Male', 'James', 86224),
 (1951, 'Male', 'James', 87261),
 (1952, 'Male', 'James', 87063),
 (1999, 'Male', 'Jacob', 35363),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Male', 'Jacob', 30574),
 (2003, 'Male', 'Jacob', 29638),
 (2004, 'Male', 'Jacob', 27881),
 (2005, 'Male', 'Jacob', 25833),
 (2006, 'Male', 'Jacob', 24845),
 (2007, 'Male', 'Jacob', 24282),
 (2008, 'Male', 'Jacob', 22594),
 (2009, 'Male', 'Jacob', 21175),
 (2010, 'Male', 'Jacob', 22127),
 (2011, 'Male', 'Jacob', 20371),
 (2012, 'Male', 'Jacob', 19074)]

In [33]:
%%sql
--filter for missing values?
SELECT * FROM countries
WHERE land IS NULL

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('CUW', 'Curacao', 'Latin America & Caribbean', 'High income', None),
 ('MAF', 'St. Martin (French part)', 'Latin America & Caribbean', 'High income', None),
 ('MCO', 'Monaco', 'Europe & Central Asia', 'High income', None),
 ('SDN', 'Sudan', 'Sub-Saharan Africa', 'Lower middle income', None),
 ('SSD', 'South Sudan', 'Sub-Saharan Africa', 'Low income', None),
 ('SXM', 'Sint Maarten (Dutch part)', 'Latin America & Caribbean', 'High income', None),
 ('XKX', 'Kosovo', 'Europe & Central Asia', 'Upper middle income', None)]

In [36]:
%%sql
--filter for non missing values?
SELECT * FROM countries
WHERE land IS NOT NULL
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0)]

In [38]:
%%sql
-- how many total obs?
SELECT COUNT(*) AS total_obs FROM countries

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(217,)]

In [39]:
%%sql
-- how many missing land obs?
SELECT COUNT(*) AS missing_obs FROM countries
WHERE land IS NULL

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(7,)]

In [41]:
%%sql
-- how to return the number of unique baby names in the topnames table?
SELECT COUNT(DISTINCT name) AS total FROM topnames

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(18,)]

In [42]:
%%sql
-- what are these unique baby names?
SELECT DISTINCT(name) FROM topnames

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('Mary',),
 ('John',),
 ('Robert',),
 ('James',),
 ('Linda',),
 ('Michael',),
 ('David',),
 ('Lisa',),
 ('Jennifer',),
 ('Jessica',),
 ('Ashley',),
 ('Emily',),
 ('Jacob',),
 ('Emma',),
 ('Isabella',),
 ('Sophia',),
 ('Noah',),
 ('Liam',)]

In [43]:
%%sql
-- create a new variable land_milesq that stores the km2 data stored in the column land
-- as milessq.
SELECT *, land*0.3861 AS land_milesq FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 69.498),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0, 252069.246),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0, 481350.87),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0, 10579.14),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0, 181.467)]

In [49]:
%%sql
-- create a new binary variable "large_country" that equals 1 for countries whose land size is 
-- greater than 1 million kilometers squared.
SELECT *, land>1000000 AS large_country FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0, 0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0, 1),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0, 0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0, 0)]

In [50]:
'Aruba' + ' ' + '(ABW)'

'Aruba (ABW)'

In [61]:
%%sql
-- create a new column named country2 that takes form of "country (code)"
SELECT *, country || ' (' || code || ')' AS countries2 FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 'Aruba (ABW)'),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0, 'Afghanistan (AFG)'),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0, 'Angola (AGO)'),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0, 'Albania (ALB)'),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0, 'Andorra (AND)')]

In [58]:
%%sql
-- how to next sql queries?
SELECT COUNT(*) AS total_obs, (SELECT COUNT(*) FROM countries WHERE land is NULL) AS missing_obs 
FROM countries

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(217, 7)]

In [60]:
%%sql
-- average land size in km2
SELECT AVG(land) AS avg_land FROM countries

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(606227.8095238095,)]

In [7]:
%%sql
-- return countries whose land size is greater than the average land size in the data?
-- use nested queries where you combine finding the average with filtering using WHERE

SELECT * FROM countries
WHERE land > (SELECT AVG(land) FROM countries)
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ARG', 'Argentina', 'Latin America & Caribbean', 'Upper middle income', 2736690.0),
 ('AUS', 'Australia', 'East Asia & Pacific', 'High income', 7692020.0),
 ('BOL', 'Bolivia', 'Latin America & Caribbean', 'Lower middle income', 1083300.0)]

In [14]:
%%sql
-- a similar but more advanced case
-- first filter based on average gdp
-- then filter based on average gdp in 1990
-- return output only for 1990

SELECT * FROM indicators
WHERE gdp > (SELECT AVG(gdp) FROM indicators WHERE year=1990)
AND year=1990
LIMIT 10

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1990, 'ARG', 32.62, 141.35, 71.6, 0.01, 4078.48, 12352.0),
 (1990, 'AUS', 17.07, 310.77, 77.0, 0.18, 43051.4, 38982.5),
 (1990, 'AUT', 7.68, 166.46, 75.6, 0.07, 49287.2, 41389.8),
 (1990, 'BEL', 9.97, 206.43, 76.1, 0.04, None, None),
 (1990, 'BRA', 149.0, 461.95, 65.3, 0.0, 24977.3, 31388.9),
 (1990, 'CAN', 27.69, 593.93, 77.4, 0.58, 131641.0, 126441.0),
 (1990, 'CHE', 6.72, 258.07, 77.2, 0.13, 69703.8, 63797.4),
 (1990, 'CHN', 1135.18, 360.86, 69.3, 0.02, 53809.6, 62755.9),
 (1990, 'DEU', 79.43, 1764.97, 75.2, 0.27, 346415.0, 408874.0),
 (1990, 'DNK', 5.14, 138.25, 74.8, 0.15, 31371.7, 34030.1)]

In [18]:
%%sql
-- This returns the total land size on earth
SELECT SUM(land) FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(127307840.0,)]

In [25]:
%%sql
-- How to return land size of each continent in a table?
SELECT region, SUM(land) AS total_land FROM countries
GROUP BY region
ORDER BY total_land DESC

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('Europe & Central Asia', 27429254.6),
 ('East Asia & Pacific', 24361338.4),
 ('Sub-Saharan Africa', 21242361.0),
 ('Latin America & Caribbean', 20038832.0),
 ('North America', 18240984.0),
 ('Middle East & North Africa', 11223466.0),
 ('South Asia', 4771604.0)]

In [28]:
%%sql
-- How to return land size of each continent in a table?
-- In addition, you can place further filtering after group by
-- using HAVING
SELECT region, SUM(land) AS total_land FROM countries
GROUP BY region
HAVING total_land > 20000000
ORDER BY total_land DESC

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('Europe & Central Asia', 27429254.6),
 ('East Asia & Pacific', 24361338.4),
 ('Sub-Saharan Africa', 21242361.0),
 ('Latin America & Caribbean', 20038832.0)]

In [41]:
%%sql
-- How to return land size of each continent in a table?
-- In addition, you can place further filtering after group by
-- using HAVING
SELECT region, SUM(land) AS total_land FROM countries
WHERE land > 1000000
GROUP BY region

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('East Asia & Pacific', 20445360.0),
 ('Europe & Central Asia', 19076600.0),
 ('Latin America & Caribbean', 16511580.0),
 ('Middle East & North Africa', 7919730.0),
 ('North America', 18240930.0),
 ('South Asia', 2973190.0),
 ('Sub-Saharan Africa', 9503630.0)]

In [43]:
%%sql
-- Can you return only the largest region
SELECT region, SUM(land) AS total_land FROM countries
GROUP BY region
HAVING total_land > 20000000
ORDER BY total_land DESC
LIMIT 1

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('Europe & Central Asia', 27429254.6)]

In [57]:
%%sql
-- Return the top 10 most popular baby names that existed in the U.S. and their counts and sex
SELECT name, SUM(count) AS tot_name, sex FROM topnames
GROUP BY name
ORDER BY tot_name DESC
LIMIT 10

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('Mary', 3098428, 'Female'),
 ('Michael', 3084824, 'Male'),
 ('James', 1056228, 'Male'),
 ('Robert', 1041984, 'Male'),
 ('John', 861403, 'Male'),
 ('Jennifer', 859209, 'Female'),
 ('Linda', 508407, 'Female'),
 ('Lisa', 420572, 'Female'),
 ('Jessica', 397962, 'Female'),
 ('Jacob', 370779, 'Male')]

In [59]:
%%sql
-- Return the top 10 "oldest" baby names
-- Return name and sex of each oldest baby name
SELECT year, name, sex FROM topnames
GROUP BY name
ORDER BY year ASC
LIMIT 10

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'John', 'Male'),
 (1880, 'Mary', 'Female'),
 (1924, 'Robert', 'Male'),
 (1940, 'James', 'Male'),
 (1947, 'Linda', 'Female'),
 (1954, 'Michael', 'Male'),
 (1960, 'David', 'Male'),
 (1962, 'Lisa', 'Female'),
 (1970, 'Jennifer', 'Female'),
 (1985, 'Jessica', 'Female')]

In [62]:
%%sql
-- Return the top 10 "oldest" baby names
-- Return name and sex of each oldest baby name
-- To get a sense of what years a name tended to show up
SELECT name, sex, ROUND(AVG(year),2) AS avg_year FROM topnames
GROUP BY name
ORDER BY avg_year ASC
LIMIT 10

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('John', 'Male', 1901.5),
 ('Mary', 'Female', 1918.21),
 ('Robert', 'Male', 1932.76),
 ('James', 'Male', 1946.0),
 ('Linda', 'Female', 1949.5),
 ('David', 'Male', 1960.0),
 ('Lisa', 'Female', 1965.5),
 ('Michael', 'Male', 1976.36),
 ('Jennifer', 'Female', 1977.0),
 ('Jessica', 'Female', 1989.67)]

In [66]:
%%sql
--"Newer" names?
SELECT name, sex, ROUND(AVG(year),2) AS avg_year FROM topnames
GROUP BY name
ORDER BY avg_year DESC
LIMIT 10

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('Liam', 'Male', 2017.5),
 ('Emma', 'Female', 2014.67),
 ('Noah', 'Male', 2014.5),
 ('Sophia', 'Female', 2012.0),
 ('Isabella', 'Female', 2009.5),
 ('Jacob', 'Male', 2005.5),
 ('Emily', 'Female', 2001.5),
 ('Ashley', 'Female', 1991.5),
 ('Jessica', 'Female', 1989.67),
 ('Jennifer', 'Female', 1977.0)]

In [2]:
%sql sqlite:///C:\Users\bilene\Downloads\school.db

In [3]:
%sql SELECT name FROM sqlite_master where type='table'

 * sqlite:///C:\Users\bilene\Downloads\school.db
Done.

[('subjects',),
 ('instructors',),
 ('departments',),
 ('students',),
 ('courses',),
 ('classes',),
 ('instructor_class',),
 ('student_class',)]

In [78]:
%sql SELECT * FROM instructors limit 5

   sqlite:///C:\Users\bilene\Downloads\book.db
 * sqlite:///C:\Users\bilene\Downloads\school.db
Done.

[(9000, 'Brandon', 'Santos', 'ART', 'Granville', 'OH', 'Associate Professor, Art'),
 (9001, 'Margaux', 'Gillet', 'PHED', 'Granville', 'OH', 'Wellness Coordinator'),
 (9002, 'Tom', 'Werner', 'ENVS', 'Granville', 'OH', "Vis. Ass't. Prof, Env. Studies"),
 (9003, 'Roger', 'Davidson', 'SA', 'Columbus', 'OH', "Vis.Ass't Prof., Soc/Anthr, PT"),
 (9004, 'Sharon', 'Jimenez', 'LANG', 'Granville', 'OH', "Ass't Prof., Modern Languages")]

In [23]:
%%sql 
SELECT * FROM departments
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\school.db
Done.

[('ANSO', 'Anthropology and Sociology', None, 'Social Sciences'),
 ('ART', 'Art History and Visual Culture', 9252, 'Fine Arts'),
 ('BIOL', 'Biology', None, 'Natural Sciences'),
 ('BLST', 'Black Studies', 9133, 'Interdisciplinary'),
 ('CHEM', 'Chemistry and Biochemistry', 9143, 'Natural Sciences')]

In [21]:
%%sql 
SELECT * FROM instructor_class
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\school.db
Done.

[(40366, None), (40531, None), (40394, None), (40083, None), (21708, None)]

In [76]:
%sql SELECT * FROM departments limit 5

   sqlite:///C:\Users\bilene\Downloads\book.db
 * sqlite:///C:\Users\bilene\Downloads\school.db
Done.

[('ANSO', 'Anthropology and Sociology', None, 'Social Sciences'),
 ('ART', 'Art History and Visual Culture', 9252, 'Fine Arts'),
 ('BIOL', 'Biology', None, 'Natural Sciences'),
 ('BLST', 'Black Studies', 9133, 'Interdisciplinary'),
 ('CHEM', 'Chemistry and Biochemistry', 9143, 'Natural Sciences')]

In [43]:
%sql SELECT * FROM classes limit 5

 * sqlite:///C:\Users\bilene\Downloads\school.db
Done.

[(40002, 'FALL', 'THTR', 100, '01', '09:30-10:20 MWF'),
 (40003, 'FALL', 'THTR', 110, '01', '14:30-17:50 M'),
 (40004, 'FALL', 'THTR', 120, '01', '10:00-11:20 TR'),
 (40005, 'FALL', 'THTR', 160, '01', None),
 (40006, 'FALL', 'THTR', 165, '01', None)]

In [81]:
%%sql
-- What is the name of the instructor whose id is 9252?
SELECT * FROM instructors
WHERE instructorid=9252

   sqlite:///C:\Users\bilene\Downloads\book.db
 * sqlite:///C:\Users\bilene\Downloads\school.db
Done.

[(9252, 'Christine', 'Scott', 'ART', 'Granville', 'OH', 'Associate Professor, Art')]

In [17]:
%%sql
-- Return a list of department chairs including their names and departments?
SELECT departmentname, instructorfirst,instructorlast FROM departments
INNER JOIN
instructors
ON departments.departmentchair = instructors.instructorid
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\school.db
Done.

[('Art History and Visual Culture', 'Christine', 'Scott'),
 ('Black Studies', 'Aarav', 'Jhadav'),
 ('Chemistry and Biochemistry', 'Judith', 'Burton'),
 ('Cinema', 'Theresa', 'Rice'),
 ('Classical Studies', 'Craig', 'Owens')]

In [29]:
%%sql
-- return the instructorid, first and last name, dept id, and department's divison
-- for the insructors who taught the classes with the following classid: 21014, 21088, 21256, 21444
SELECT instructorid,instructorfirst,instructorlast,departmentid,division FROM departments
INNER JOIN instructors
USING(departmentid)
INNER JOIN instructor_class
USING(instructorid)
WHERE classid IN ('21014','21088','21256','21444')

 * sqlite:///C:\Users\bilene\Downloads\school.db
Done.

[(9167, 'Helen', 'Foster', 'PSYC', 'Natural Sciences'),
 (9029, 'Grace', 'Hawkins', 'PHIL', 'Humanities'),
 (9146, 'Jason', 'Garrett', 'ECON', 'Social Sciences'),
 (9050, 'Taylor', 'Price', 'PHED', 'Social Sciences')]

In [42]:
%%sql
--equivalently:
SELECT instructors.instructorid, instructors.instructorfirst, instructors.instructorlast,
departments.departmentid, departments.departmentname FROM departments
INNER JOIN instructors
ON departments.departmentid = instructors.departmentid
INNER JOIN instructor_class
ON instructors.instructorid = instructor_class.instructorid
WHERE classid=21014 OR classid=21088 OR classid=21256 OR classid=21444

 * sqlite:///C:\Users\bilene\Downloads\school.db
Done.

[(9167, 'Helen', 'Foster', 'PSYC', 'Psychology'),
 (9029, 'Grace', 'Hawkins', 'PHIL', 'Philosophy'),
 (9146, 'Jason', 'Garrett', 'ECON', 'Economics'),
 (9050, 'Taylor', 'Price', 'PHED', 'Health, Exercise, & Sport Stud')]

In [50]:
%%sql
-- return a table that shows these same courses in the following format:
-- column1: 4lettercoursesubject-coursenumber-section
-- column2: class meeting times for the same classes: '21014','21088','21256','21444
-- Note: use "||" which is "+"  in SQL
SELECT coursesubject || "-" || coursenum || "-" || classsection AS classinfo, classmeeting FROM classes
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\school.db
Done.

[('THTR-100-01', '09:30-10:20 MWF'),
 ('THTR-110-01', '14:30-17:50 M'),
 ('THTR-120-01', '10:00-11:20 TR'),
 ('THTR-160-01', None),
 ('THTR-165-01', None)]

In [ ]:
%%sql
-- extension to the table above: return a third column "enrollment" showing how many students each section has
-- Note: count the students from the student_class table using COUNT(); use GROUP BY
SELECT coursesubject || "-" || coursenum || "-" || classsection AS classinfo, classmeeting FROM classes
LIMIT 5

In [ ]:
-- filter based on the average gdp for each country

In [66]:
%%sql
-- another subquery example
-- create a new binary variable "large_country" that equals 1 for countries whose land size is 
-- greater than 1 million squared miles.
SELECT *, land * 0.3861 AS land_milesq, (land * 0.3861 > 1000000) AS large_country 
FROM countries
LIMIT 8

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 69.498, 0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0, 252069.246, 0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0, 481350.87, 0),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0, 10579.14, 0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0, 181.467, 0),
 ('ARE', 'United Arab Emirates', 'Middle East & North Africa', 'High income', 71020.0, 27420.822, 0),
 ('ARG', 'Argentina', 'Latin America & Caribbean', 'Upper middle income', 2736690.0, 1056636.009, 1),
 ('ARM', 'Armenia', 'Europe & Central Asia', 'Upper middle income', 28470.0, 10992.267, 0)]